#### Terraform Plan
```
Acquiring state lock. This may take a few moments...
module.apis.google_project_service.compute: Refreshing state... [id=lumios-490217/compute.googleapis.com]
module.apis.google_project_service.iam: Refreshing state... [id=lumios-490217/iam.googleapis.com]
module.apis.google_project_service.artifactregistry: Refreshing state... [id=lumios-490217/artifactregistry.googleapis.com]
module.apis.google_project_service.cloudresourcemanager: Refreshing state... [id=lumios-490217/cloudresourcemanager.googleapis.com]
module.apis.google_project_service.run: Refreshing state... [id=lumios-490217/run.googleapis.com]
module.apis.google_project_service.secretmanager: Refreshing state... [id=lumios-490217/secretmanager.googleapis.com]
module.storage.google_storage_bucket.photos: Refreshing state... [id=lumios-photos-lumios-490217]
module.network.google_compute_network.lumios: Refreshing state... [id=projects/lumios-490217/global/networks/lumios]
module.secrets.google_secret_manager_secret.jwt_secret: Refreshing state... [id=projects/lumios-490217/secrets/lumios-jwt-secret]
module.secrets.google_secret_manager_secret.postgres_password: Refreshing state... [id=projects/lumios-490217/secrets/lumios-postgres-password]
module.artifact_registry.google_artifact_registry_repository.lumios: Refreshing state... [id=projects/lumios-490217/locations/europe-west1/repositories/lumios]
module.secrets.google_secret_manager_secret.google_client_id: Refreshing state... [id=projects/lumios-490217/secrets/lumios-google-client-id]
module.secrets.google_secret_manager_secret.secret_key: Refreshing state... [id=projects/lumios-490217/secrets/lumios-secret-key]
module.secrets.random_password.init_admin_password: Refreshing state... [id=none]
module.secrets.random_password.secret_key: Refreshing state... [id=none]
module.secrets.random_password.jwt_secret: Refreshing state... [id=none]
module.secrets.google_secret_manager_secret.google_client_secret: Refreshing state... [id=projects/lumios-490217/secrets/lumios-google-client-secret]
module.secrets.random_password.postgres: Refreshing state... [id=none]
module.secrets.google_secret_manager_secret.init_admin_password: Refreshing state... [id=projects/lumios-490217/secrets/lumios-init-admin-password]
module.secrets.google_secret_manager_secret.google_frontend_client_id: Refreshing state... [id=projects/lumios-490217/secrets/lumios-google-frontend-client-id]
module.secrets.google_secret_manager_secret_version.init_admin_password: Refreshing state... [id=projects/714378756224/secrets/lumios-init-admin-password/versions/1]
module.secrets.google_secret_manager_secret_version.jwt_secret: Refreshing state... [id=projects/714378756224/secrets/lumios-jwt-secret/versions/1]
module.secrets.google_secret_manager_secret_version.postgres_password: Refreshing state... [id=projects/714378756224/secrets/lumios-postgres-password/versions/1]
module.secrets.google_secret_manager_secret_version.secret_key: Refreshing state... [id=projects/714378756224/secrets/lumios-secret-key/versions/1]
module.network.google_compute_subnetwork.lumios: Refreshing state... [id=projects/lumios-490217/regions/europe-west1/subnetworks/lumios-europe-west1]
module.vm.google_service_account.vm: Refreshing state... [id=projects/lumios-490217/serviceAccounts/lumios-vm@lumios-490217.iam.gserviceaccount.com]
module.vm.google_compute_firewall.allow_db: Refreshing state... [id=projects/lumios-490217/global/firewalls/lumios-allow-db-internal]
module.vm.google_compute_disk.data: Refreshing state... [id=projects/lumios-490217/zones/europe-west1-b/disks/lumios-data]
module.vm.google_compute_firewall.allow_iap_ssh: Refreshing state... [id=projects/lumios-490217/global/firewalls/lumios-allow-iap-ssh]
module.vm.google_secret_manager_secret_iam_member.vm_postgres_password: Refreshing state... [id=projects/lumios-490217/secrets/lumios-postgres-password/roles/secretmanager.secretAccessor/serviceAccount:lumios-vm@lumios-490217.iam.gserviceaccount.com]
module.vm.google_compute_instance.vm: Refreshing state... [id=projects/lumios-490217/zones/europe-west1-b/instances/lumios-vm]
module.cloudrun.data.google_client_openid_userinfo.terraform: Reading...
module.cloudrun.google_secret_manager_secret.gcs_hmac_access_key: Refreshing state... [id=projects/lumios-490217/secrets/lumios-gcs-hmac-access-key]
module.cloudrun.google_service_account.cloudrun: Refreshing state... [id=projects/lumios-490217/serviceAccounts/lumios-cloudrun@lumios-490217.iam.gserviceaccount.com]
module.cloudrun.google_secret_manager_secret.gcs_hmac_secret: Refreshing state... [id=projects/lumios-490217/secrets/lumios-gcs-hmac-secret]
module.cloudrun.google_secret_manager_secret_iam_member.cloudrun_google_frontend_client_id: Refreshing state... [id=projects/lumios-490217/secrets/lumios-google-frontend-client-id/roles/secretmanager.secretAccessor/serviceAccount:lumios-cloudrun@lumios-490217.iam.gserviceaccount.com]
module.cloudrun.google_secret_manager_secret_iam_member.cloudrun_init_admin_password: Refreshing state... [id=projects/lumios-490217/secrets/lumios-init-admin-password/roles/secretmanager.secretAccessor/serviceAccount:lumios-cloudrun@lumios-490217.iam.gserviceaccount.com]
module.cloudrun.google_secret_manager_secret_iam_member.cloudrun_secret_key: Refreshing state... [id=projects/lumios-490217/secrets/lumios-secret-key/roles/secretmanager.secretAccessor/serviceAccount:lumios-cloudrun@lumios-490217.iam.gserviceaccount.com]
module.cloudrun.google_secret_manager_secret_iam_member.cloudrun_postgres_password: Refreshing state... [id=projects/lumios-490217/secrets/lumios-postgres-password/roles/secretmanager.secretAccessor/serviceAccount:lumios-cloudrun@lumios-490217.iam.gserviceaccount.com]
module.cloudrun.google_secret_manager_secret_iam_member.cloudrun_google_client_secret: Refreshing state... [id=projects/lumios-490217/secrets/lumios-google-client-secret/roles/secretmanager.secretAccessor/serviceAccount:lumios-cloudrun@lumios-490217.iam.gserviceaccount.com]
module.cloudrun.google_secret_manager_secret_iam_member.cloudrun_google_client_id: Refreshing state... [id=projects/lumios-490217/secrets/lumios-google-client-id/roles/secretmanager.secretAccessor/serviceAccount:lumios-cloudrun@lumios-490217.iam.gserviceaccount.com]
module.cloudrun.google_storage_bucket_iam_member.cloudrun_photos: Refreshing state... [id=b/lumios-photos-lumios-490217/roles/storage.objectAdmin/serviceAccount:lumios-cloudrun@lumios-490217.iam.gserviceaccount.com]
module.cloudrun.google_secret_manager_secret_iam_member.cloudrun_jwt_secret: Refreshing state... [id=projects/lumios-490217/secrets/lumios-jwt-secret/roles/secretmanager.secretAccessor/serviceAccount:lumios-cloudrun@lumios-490217.iam.gserviceaccount.com]
module.cloudrun.data.google_client_openid_userinfo.terraform: Read complete after 0s [id=terraform@lumios-490217.iam.gserviceaccount.com]
module.cloudrun.google_secret_manager_secret_iam_member.cloudrun_gcs_hmac_access_key: Refreshing state... [id=projects/lumios-490217/secrets/lumios-gcs-hmac-access-key/roles/secretmanager.secretAccessor/serviceAccount:lumios-cloudrun@lumios-490217.iam.gserviceaccount.com]
module.cloudrun.google_secret_manager_secret_iam_member.cloudrun_gcs_hmac_secret: Refreshing state... [id=projects/lumios-490217/secrets/lumios-gcs-hmac-secret/roles/secretmanager.secretAccessor/serviceAccount:lumios-cloudrun@lumios-490217.iam.gserviceaccount.com]
module.cloudrun.google_cloud_run_v2_service.backend: Refreshing state... [id=projects/lumios-490217/locations/europe-west1/services/lumios-backend]
module.cloudrun.google_cloud_run_v2_service_iam_member.public: Refreshing state... [id=projects/lumios-490217/locations/europe-west1/services/lumios-backend/roles/run.invoker/allUsers]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # module.cloudrun.google_cloud_run_v2_service.backend will be updated in-place
  ~ resource "google_cloud_run_v2_service" "backend" {
        id                      = "projects/lumios-490217/locations/europe-west1/services/lumios-backend"
        name                    = "lumios-backend"
        # (35 unchanged attributes hidden)

      ~ template {
            # (11 unchanged attributes hidden)

          ~ containers {
                name           = null
                # (7 unchanged attributes hidden)

              - env {
                  - name  = "REDIS_URL" -> null
                  - value = "redis://10.0.0.3:6379" -> null
                }
              + env {
                  + name  = "FRONTEND_URL"
                  + value = "https://TODO.lumios.at"
                }

                # (17 unchanged blocks hidden)
            }

            # (2 unchanged blocks hidden)
        }

        # (2 unchanged blocks hidden)
    }

  # module.cloudrun.google_cloud_run_v2_service.frontend will be created
  + resource "google_cloud_run_v2_service" "frontend" {
      + conditions              = (known after apply)
      + create_time             = (known after apply)
      + creator                 = (known after apply)
      + delete_time             = (known after apply)
      + deletion_protection     = false
      + effective_annotations   = (known after apply)
      + effective_labels        = {
          + "goog-terraform-provisioned" = "true"
        }
      + etag                    = (known after apply)
      + expire_time             = (known after apply)
      + generation              = (known after apply)
      + id                      = (known after apply)
      + ingress                 = "INGRESS_TRAFFIC_ALL"
      + last_modifier           = (known after apply)
      + latest_created_revision = (known after apply)
      + latest_ready_revision   = (known after apply)
      + launch_stage            = (known after apply)
      + location                = "europe-west1"
      + name                    = "lumios-frontend"
      + observed_generation     = (known after apply)
      + project                 = "lumios-490217"
      + reconciling             = (known after apply)
      + terminal_condition      = (known after apply)
      + terraform_labels        = {
          + "goog-terraform-provisioned" = "true"
        }
      + traffic_statuses        = (known after apply)
      + uid                     = (known after apply)
      + update_time             = (known after apply)
      + uri                     = (known after apply)
      + urls                    = (known after apply)

      + scaling (known after apply)

      + template {
          + max_instance_request_concurrency = (known after apply)
          + service_account                  = (known after apply)
          + timeout                          = (known after apply)

          + containers {
              + build_info = (known after apply)
              + image      = "europe-west1-docker.pkg.dev/lumios-490217/lumios/frontend:latest"

              + env {
                  + name  = "BACKEND_URL"
                  + value = "https://lumios-backend-26yl7pvf3a-ew.a.run.app"
                }

              + ports (known after apply)

              + resources {
                  + limits = {
                      + "cpu"    = "1"
                      + "memory" = "256Mi"
                    }
                }

              + startup_probe (known after apply)
            }

          + scaling {
              + max_instance_count = 2
            }
        }

      + traffic (known after apply)
    }

  # module.cloudrun.google_cloud_run_v2_service_iam_member.frontend_public will be created
  + resource "google_cloud_run_v2_service_iam_member" "frontend_public" {
      + etag     = (known after apply)
      + id       = (known after apply)
      + location = "europe-west1"
      + member   = "allUsers"
      + name     = "lumios-frontend"
      + project  = (known after apply)
      + role     = "roles/run.invoker"
    }

  # module.cloudrun.google_secret_manager_secret_version.gcs_hmac_access_key will be created
  + resource "google_secret_manager_secret_version" "gcs_hmac_access_key" {
      + create_time            = (known after apply)
      + deletion_policy        = "DELETE"
      + destroy_time           = (known after apply)
      + enabled                = true
      + id                     = (known after apply)
      + name                   = (known after apply)
      + project                = (known after apply)
      + secret                 = "projects/lumios-490217/secrets/lumios-gcs-hmac-access-key"
      + secret_data            = (sensitive value)
      + secret_data_wo_version = 0
      + version                = (known after apply)
    }

  # module.cloudrun.google_secret_manager_secret_version.gcs_hmac_secret will be created
  + resource "google_secret_manager_secret_version" "gcs_hmac_secret" {
      + create_time            = (known after apply)
      + deletion_policy        = "DELETE"
      + destroy_time           = (known after apply)
      + enabled                = true
      + id                     = (known after apply)
      + name                   = (known after apply)
      + project                = (known after apply)
      + secret                 = "projects/lumios-490217/secrets/lumios-gcs-hmac-secret"
      + secret_data            = (sensitive value)
      + secret_data_wo_version = 0
      + version                = (known after apply)
    }

  # module.cloudrun.google_service_account_iam_member.terraform_token_creator will be created
  + resource "google_service_account_iam_member" "terraform_token_creator" {
      + etag               = (known after apply)
      + id                 = (known after apply)
      + member             = "serviceAccount:terraform@lumios-490217.iam.gserviceaccount.com"
      + role               = "roles/iam.serviceAccountUser"
      + service_account_id = "projects/lumios-490217/serviceAccounts/lumios-cloudrun@lumios-490217.iam.gserviceaccount.com"
    }

  # module.cloudrun.google_storage_hmac_key.cloudrun will be created
  + resource "google_storage_hmac_key" "cloudrun" {
      + access_id             = (known after apply)
      + id                    = (known after apply)
      + project               = "lumios-490217"
      + secret                = (sensitive value)
      + service_account_email = "lumios-cloudrun@lumios-490217.iam.gserviceaccount.com"
      + state                 = "ACTIVE"
      + time_created          = (known after apply)
      + updated               = (known after apply)
    }

Plan: 6 to add, 1 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "tfplan"

```